"use strict";

//let x = 5; alert( x++);  вернет 5 ++x =6;
//[ ] + false - null + true = NaN

// console.log (typeof([]+ false)); //"false"

// let y =1;
// let x = y =2;
// alert(x);

//[] + 1 + 2    =12

//alert( "1"[0]); вернет 1 изза того что 0 квю скобках это обращение к элементу строки то есть к 1це

// console.log(2 && 1 && null && 0 && undefined); вернет false потому что && запинается на неправдивом (лжи) в выражении bolean




// && (И) запинается на лжи
// || (Или) запинается на правде



//console.log(!!(1 && 2) === (1 && 2)); не равны ибо '!!' превращают значение в булиновое
                  3
// alert (null || 2 && 3 || 4);  // вернется 3ка


// let a = [1,2,3];
// let b = [1,2,3];  a не равно b потому что єто 2 разных масива с одинаковыми значениями в нутри;

// alert(+'infinity');

// console.log("Ежик">"яблоко");


